Revit 2024 API
DocumentSetIterator Class
An iterator to a set of documents.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public abstract class DocumentSetIterator : APIObject,
	IEnumerator
Visual Basic
Public MustInherit Class DocumentSetIterator _
	Inherits APIObject _
	Implements IEnumerator
Visual C++
public ref class DocumentSetIterator abstract : public APIObject,
	IEnumerator
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.DocumentSetIterator
See Also
DocumentSetIterator Members
Autodesk.Revit.DB Namespace